# Revision Pandas WsCubeTech

In [1]:
import pandas as pd
import numpy as np

# Importing InteractiveShell from IPython and setting ast_node_interactivity to "all"
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Pandas Series

In [2]:
data = [2, 3, 4, 5, 6, 7]
Ser1 = pd.Series(data,index=['a', 'b', 'c', 'd', 'e', 'f'])
Ser1
type(Ser1)
Ser1.iloc[2]

a    2
b    3
c    4
d    5
e    6
f    7
dtype: int64

pandas.core.series.Series

4

In [3]:
dict = {
    'Name' : ['Python', 'Sql', 'PowerBI', 'Excel'],
    'Rank' : [1, 4, 3, 2],
    'Popularity' : [12,  13, 14, 15]
}
Ser2 = pd.Series(dict)
print(Ser2)

Name          [Python, Sql, PowerBI, Excel]
Rank                           [1, 4, 3, 2]
Popularity                 [12, 13, 14, 15]
dtype: object

In [4]:
Ser3 = pd.Series(12,index= [1, 2 ,3, 4, 5, 6, 7])
Ser3

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64

In [5]:
Ser4 = pd.Series(12,index= [1, 2 ,3, 4, 5, 6])
Ser5 = pd.Series(12,index= [1, 2 ,3])
print(Ser4 + Ser5)

1    24.0
2    24.0
3    24.0
4     NaN
5     NaN
6     NaN
dtype: float64

## Pandas DataFrame

In [6]:
list = [1, 2, 3, 4, 5, 6]
df1 = pd.DataFrame(list)
type(df1)

pandas.core.frame.DataFrame

In [7]:
dict = {
    'Name' : ['Python', 'Sql', 'PowerBI', 'Excel'],
    'Rank' : [1, 4, 3, 2],
    'Popularity' : [12,  13, 14, 15]
}

df2 = pd.DataFrame(dict)
df2

      Name  Rank  Popularity
0   Python     1          12
1      Sql     4          13
2  PowerBI     3          14
3    Excel     2          15

In [8]:
df3 = pd.DataFrame(dict, columns=["Name", "Popularity"])
df3

      Name  Popularity
0   Python          12
1      Sql          13
2  PowerBI          14
3    Excel          15

In [9]:
df4 = pd.DataFrame(dict, columns=["Name", "Popularity"], index= [1,2,3,4])
df4

      Name  Popularity
1   Python          12
2      Sql          13
3  PowerBI          14
4    Excel          15

In [10]:
df4["Name"] [2]

'Sql'

In [11]:
listnew = [[1,2,3,4,5],[6,7,8,9,0]]
df5= pd.DataFrame(listnew)
df5

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  0

In [12]:
dictnew = {"Series1": pd.Series([1,2,3,4,5]), "Series2": pd.Series([6,7,8,9,np.nan])}
df6= pd.DataFrame(dictnew)
df6

   Series1  Series2
0        1      6.0
1        2      7.0
2        3      8.0
3        4      9.0
4        5      NaN

## Arithmetic Operations in Pandas

In [13]:
dict_sales = {"Price" : [10,20,15,12], "Quantity": [5,10,15,20]}
df7 = pd.DataFrame(dict_sales)
df7

   Price  Quantity
0     10         5
1     20        10
2     15        15
3     12        20

In [14]:
df = df7.copy()
df

   Price  Quantity
0     10         5
1     20        10
2     15        15
3     12        20

In [15]:
df["GrossSales"] = df["Price"] * df["Quantity"]
df

   Price  Quantity  GrossSales
0     10         5          50
1     20        10         200
2     15        15         225
3     12        20         240

In [16]:
df["Discount"] = df["GrossSales"] * .10
df

   Price  Quantity  GrossSales  Discount
0     10         5          50       5.0
1     20        10         200      20.0
2     15        15         225      22.5
3     12        20         240      24.0

In [17]:
df["NetSales"] = df["GrossSales"] - df["Discount"]
df["Status"] =  df["NetSales"] > 150
df

   Price  Quantity  GrossSales  Discount  NetSales  Status
0     10         5          50       5.0      45.0   False
1     20        10         200      20.0     180.0    True
2     15        15         225      22.5     202.5    True
3     12        20         240      24.0     216.0    True

## Delete and Insert Data in Pandas

# Insert

In [18]:
df = pd.DataFrame({
    "Day1" : [11,12,13,14,15],
    "Day2" : [91,81,71,61,51]
})

df

   Day1  Day2
0    11    91
1    12    81
2    13    71
3    14    61
4    15    51

In [19]:
df.insert(2, "Day1+Day2", df["Day1"] + df["Day2"] )
df

   Day1  Day2  Day1+Day2
0    11    91        102
1    12    81         93
2    13    71         84
3    14    61         75
4    15    51         66

In [20]:
df.insert(0 , "Day0", [10,20,30,40,50])
df

   Day0  Day1  Day2  Day1+Day2
0    10    11    91        102
1    20    12    81         93
2    30    13    71         84
3    40    14    61         75
4    50    15    51         66

In [21]:
df.insert(4,"Temp", np.nan)
df

   Day0  Day1  Day2  Day1+Day2  Temp
0    10    11    91        102   NaN
1    20    12    81         93   NaN
2    30    13    71         84   NaN
3    40    14    61         75   NaN
4    50    15    51         66   NaN

In [22]:
df["SliceData"] = df["Day1+Day2"] [:3]
df

   Day0  Day1  Day2  Day1+Day2  Temp  SliceData
0    10    11    91        102   NaN      102.0
1    20    12    81         93   NaN       93.0
2    30    13    71         84   NaN       84.0
3    40    14    61         75   NaN        NaN
4    50    15    51         66   NaN        NaN

# Delete

In [23]:
df

   Day0  Day1  Day2  Day1+Day2  Temp  SliceData
0    10    11    91        102   NaN      102.0
1    20    12    81         93   NaN       93.0
2    30    13    71         84   NaN       84.0
3    40    14    61         75   NaN        NaN
4    50    15    51         66   NaN        NaN

In [24]:
Delete_Temp_Column = df.pop("Temp")

In [25]:
Delete_Temp_Column

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: Temp, dtype: float64

In [26]:
df

   Day0  Day1  Day2  Day1+Day2  SliceData
0    10    11    91        102      102.0
1    20    12    81         93       93.0
2    30    13    71         84       84.0
3    40    14    61         75        NaN
4    50    15    51         66        NaN

In [27]:
del df["Day1+Day2"]
df

   Day0  Day1  Day2  SliceData
0    10    11    91      102.0
1    20    12    81       93.0
2    30    13    71       84.0
3    40    14    61        NaN
4    50    15    51        NaN

In [28]:
columns_to_drop = df.columns[2:]

In [29]:
df.drop(columns=columns_to_drop, inplace=True)
df

   Day0  Day1
0    10    11
1    20    12
2    30    13
3    40    14
4    50    15

# Write CSV in Pandas

In [30]:
import pandas as pd

# Sample Indian data
data = {
    'Name': ['Akash', 'Priya', 'Rahul', 'Neha', 'Amit', 'Pooja', 'Ravi', 'Anita', 'Raj', 'Sneha'],
    'DateofBirth': ['1990-05-12', '1985-09-23', '1988-07-15', '1992-02-28', '1995-11-03', '1987-04-18', '1983-12-30', '1993-08-09', '1991-06-25', '1989-10-07'],
    'State': ['Maharashtra', 'Uttar Pradesh', 'Gujarat', 'Karnataka', 'Tamil Nadu', 'Kerala', 'West Bengal', 'Punjab', 'Madhya Pradesh', 'Rajasthan'],
    'Country': ['India', 'India', 'India', 'India', 'India', 'India', 'India', 'India', 'India', 'India'],
    'Salary': [50000, 60000, 55000, 70000, 45000, 75000, 48000, 52000, 68000, 59000],
    'MobileNo': ['9876543210', '8765432109', '7654321098', '6543210987', '5432109876', '4321098765', '3210987654', '2109876543', '1098765432', '9987654321']
}

# Creating DataFrame
df = pd.DataFrame(data)

print(df)

    Name DateofBirth           State Country  Salary    MobileNo
0  Akash  1990-05-12     Maharashtra   India   50000  9876543210
1  Priya  1985-09-23   Uttar Pradesh   India   60000  8765432109
2  Rahul  1988-07-15         Gujarat   India   55000  7654321098
3   Neha  1992-02-28       Karnataka   India   70000  6543210987
4   Amit  1995-11-03      Tamil Nadu   India   45000  5432109876
5  Pooja  1987-04-18          Kerala   India   75000  4321098765
6   Ravi  1983-12-30     West Bengal   India   48000  3210987654
7  Anita  1993-08-09          Punjab   India   52000  2109876543
8    Raj  1991-06-25  Madhya Pradesh   India   68000  1098765432
9  Sneha  1989-10-07       Rajasthan   India   59000  9987654321

In [31]:
df.to_csv("Emp_Data.csv", index=False, header=["Name", "DOB", "State", "Country", "Salary", "Phone"])

In [32]:
ls

 Volume in drive D is DATA
 Volume Serial Number is F4FD-2194

 Directory of D:\GITHUB\Python\wsCubeTech\Pandas

26-04-2024  00:07    <DIR>          .
27-02-2024  05:56    <DIR>          ..
25-04-2024  20:18    <DIR>          .ipynb_checkpoints
24-02-2024  01:53               249 cb.csv
26-04-2024  00:07               548 Emp_Data.csv
24-02-2024  01:53             1,131 fin.csv
24-02-2024  01:53             1,027 finnew.csv
24-02-2024  01:53             2,452 movies.csv
24-02-2024  01:53             2,358 movies_1.csv
24-02-2024  01:53        10,104,601 Pandas WsCubeTech.ipynb
24-02-2024  01:53        10,077,327 Pandas WsCubeTech_1.ipynb
24-02-2024  01:53         2,891,872 Pandas WsCubeTech_2.ipynb
26-04-2024  00:07            12,828 Revision Pandas.ipynb
24-04-2024  23:22            72,793 sales_data.csv
              11 File(s)     23,167,186 bytes
               3 Dir(s)  38,389,153,792 bytes free

# Read CSV in Pandas

In [33]:
df = pd.read_csv("sales_data.csv")
df.head(1)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Year
0,Government,Germany,Carretera,NaN,1513.0,3,350,"5,29,550",0,"5,29,550","3,93,380","1,36,170",Dec-23,2023

In [34]:
df.describe()

        Units Sold  Manufacturing Price  Sale Price         Year
count   700.000000           700.000000  700.000000   700.000000
mean   1608.294286            96.477143  118.428571  2022.750000
std     867.427859           108.602612  136.775515     0.433322
min     200.000000             3.000000    7.000000  2022.000000
25%     905.000000             5.000000   12.000000  2022.750000
50%    1542.500000            10.000000   20.000000  2023.000000
75%    2229.125000           250.000000  300.000000  2023.000000
max    4492.500000           260.000000  350.000000  2023.000000

In [35]:
df_with_null = df[df["Discount Band"].isnull()]
df_with_null.head(2)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Year
0,Government,Germany,Carretera,NaN,1513.0,3,350,"5,29,550",0,"5,29,550","3,93,380","1,36,170",Dec-23,2023
1,Government,Germany,Paseo,NaN,1006.0,10,350,"3,52,100",0,"3,52,100","2,61,560","90,540",Jun-23,2023

In [36]:
df_without_null  = df[df["Discount Band"].notnull()]
df_without_null.head(2)

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Year
7,Government,Mexico,Carretera,Low,1210.0,3,350,"4,23,500","4,235","4,19,265","3,14,600","1,04,665",Mar-23,2023
8,Government,Mexico,Carretera,Low,1397.0,3,350,"4,88,950","4,890","4,84,061","3,63,220","1,20,841",Oct-23,2023

In [37]:
df_top5 = pd.read_csv("sales_data.csv", nrows=100, usecols=['Date', 'Segment', 'Country', 'Product', 'Discount Band', 'Sales'])
df_top5.head(2)

      Segment  Country    Product Discount Band     Sales    Date
0  Government  Germany  Carretera           NaN  5,29,550  Dec-23
1  Government  Germany      Paseo           NaN  3,52,100  Jun-23

In [38]:
df_top5new = pd.read_csv("sales_data.csv", nrows=100, usecols=[1,2,3,4,5])
df_top5new.head(2)

   Country    Product Discount Band  Units Sold  Manufacturing Price
0  Germany  Carretera           NaN      1513.0                    3
1  Germany      Paseo           NaN      1006.0                   10

In [148]:
# Create a boolean mask to identify null values
null_mask = df.isna().any(axis=1)

# Get the indices of rows containing null values
null_indices = null_mask[null_mask].index.tolist()

# Create a boolean mask to identify rows with NaN values
nan_mask = dfneww.isna().any(axis=1)

# Get the indices of rows containing NaN values
nan_indices = dfneww[nan_mask].index.tolist()

skip_rows = null_indices + nan_indices
print(skip_rows)
print("\nTotal Skip_rows:",len(skip_rows))
skip_rows_new = skip_rows[1:]
print("\nTotal skip_rows_new:",len(skip_rows_new))

[0, 1, 2, 3, 4, 5, 6, 100, 101, 102, 103, 104, 105, 106, 200, 201, 202, 203, 204, 205, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 586, 587, 588, 589, 590, 591, 592, 593, 91, 183, 276, 536]

Total Skip_rows: 57

Total skip_rows_new: 56

In [159]:
# Combine identifying null and NaN values in a single step
skip_rows = df.isna().any(axis=1) | dfneww.isna().any(axis=1)

# Print the indices of rows to skip
print(skip_rows.index.tolist())

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699]

In [154]:
# Read CSV file without null values and skip rows, treating NaN as null values
dfneww = pd.read_csv("sales_data.csv", skiprows=skip_rows_new, header=0)

# Resetting the index after skipping rows
dfneww.reset_index(drop=True, inplace=True)

# Check for null values
print(dfneww.isnull().sum())

Segment                0
Country                0
Product                0
Discount Band          5
Units Sold             0
Manufacturing Price    0
Sale Price             0
Gross Sales            0
Discounts              0
Sales                  0
COGS                   0
Profit                 0
Date                   0
Year                   0
dtype: int64

In [156]:
import pandas as pd

# Assuming you have your DataFrame 'df'

# Identify rows with any null or NaN values
skip_rows = df.isna().any(axis=1).tolist()

# Print the total number of rows to skip (excluding the first row by default)
print(f"Total rows to skip (excluding the first): {len(skip_rows[1:])}")

Total rows to skip (excluding the first): 699